-- MariaDB dump 10.19  Distrib 10.5.12-MariaDB, for Linux (x86_64)
--
-- Host: mysql.hostinger.ro    Database: u574849695_23
-- ------------------------------------------------------
-- Server version	10.5.12-MariaDB-cll-lve

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `teachers`
--

DROP TABLE IF EXISTS `teachers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `teachers` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `id_kafedras` int(11) NOT NULL,
  `surname` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `patronymic` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `category` enum('ассистент','преподаватель','старший преподаватель','доцент','профессор') COLLATE utf8mb4_unicode_ci DEFAULT 'преподаватель',
  `birthdate` date NOT NULL DEFAULT '0000-00-00',
  `children` int(11) NOT NULL,
  `salary` decimal(7,2) DEFAULT NULL,
  `gender` enum('м','ж') COLLATE utf8mb4_unicode_ci DEFAULT 'м',
  PRIMARY KEY (`id`),
  KEY `id_kafedras` (`id_kafedras`),
  CONSTRAINT `teachers_ibfk_1` FOREIGN KEY (`id_kafedras`) REFERENCES `kafedras` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=51 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `teachers`
--

LOCK TABLES `teachers` WRITE;
/*!40000 ALTER TABLE `teachers` DISABLE KEYS */;
INSERT INTO `teachers` VALUES (1,1,'Анисимов','Жанна','никодим','доцент','1970-10-28',12,2422.52,'ж'),(2,2,'Лазарев','Алина','Гарри','доцент','2022-08-19',8,3838.10,'ж'),(3,3,'Журавлёв','Александра','вячеслав','ассистент','2013-01-25',12,3308.78,'ж'),(4,4,'Щербаков','Регина','Марк','доцент','2017-04-09',10,3228.09,'ж'),(5,5,'Александров','Маргарита','Святослав','профессор','2012-04-09',5,1912.52,'ж'),(6,6,'Макаров','Изольда','Александр','ассистент','2008-10-31',14,1722.65,'ж'),(7,7,'Ефремов','Люся','Артемий','профессор','1979-10-14',8,1343.95,'ж'),(8,8,'Некрасов','Анжелика','Владлен','ассистент','2016-02-12',6,954.49,'ж'),(9,9,'Федотов','Лидия','Гарри','ассистент','2020-11-15',15,4321.98,'ж'),(10,10,'Кудряшов','Доминика','Давид','преподаватель','1973-02-12',8,3264.69,'ж'),(11,11,'Зыков','Анжелика','Степан','доцент','2000-12-18',10,3967.62,'ж'),(12,12,'Гуляев','Федосья','Назар','старший преподаватель','2001-06-26',8,1029.31,'ж'),(13,13,'Шубин','Ирина','Эрик','старший преподаватель','1977-09-17',4,3142.31,'ж'),(14,14,'Симонов','Яна','Адам','преподаватель','1979-06-03',2,2833.53,'ж'),(15,15,'Ширяев','Раиса','радислав','профессор','2012-09-26',3,2949.58,'ж'),(16,16,'Евдокимов','Надежда','Святослав','ассистент','1991-08-24',9,1301.87,'ж'),(17,17,'Суворов','Диана','герасим','профессор','2014-05-29',2,2613.08,'ж'),(18,18,'Морозов','Флорентина','степан','ассистент','1970-02-28',1,3700.36,'ж'),(19,19,'Петров','Клара','Пётр','ассистент','1985-09-27',7,1880.86,'ж'),(20,20,'Котов','Таисия','Влад','ассистент','1970-08-07',11,3304.65,'ж'),(21,21,'Жданов','Александра','виктор','старший преподаватель','2007-06-19',0,1036.64,'ж'),(22,22,'Харитонов','Рената','владлен','профессор','2017-01-03',12,2395.46,'ж'),(23,23,'Журавлёв','Анфиса','Борис','старший преподаватель','2018-04-25',0,1323.61,'ж'),(24,24,'Филатов','Лада','Роберт','ассистент','1996-11-05',11,962.85,'ж'),(25,25,'Щукин','Марина','Эдуард','доцент','2016-09-19',6,3348.52,'ж'),(26,26,'Федосеев','Виктория','Василий','старший преподаватель','2021-11-16',9,3833.40,'ж'),(27,27,'Никитин','Маргарита','Август','профессор','2007-04-28',12,2063.66,'ж'),(28,28,'Игнатов','Раиса','данила','профессор','2021-05-21',14,4879.06,'ж'),(29,29,'Кузнецов','Нонна','добрыня','ассистент','1995-10-04',3,1413.69,'ж'),(30,30,'Сергеев','Таисия','Игнатий','ассистент','2001-09-20',5,3303.56,'ж'),(31,31,'Громов','Алиса','Витольд','профессор','2012-05-28',15,1001.72,'ж'),(32,32,'Соловьёв','Фаина','Аким','доцент','2007-08-16',13,1183.20,'ж'),(33,33,'Сысоев','Александра','Артур','преподаватель','2020-04-07',11,3649.09,'ж'),(34,34,'Рыбаков','Владлена','Егор','старший преподаватель','2006-06-14',12,2904.76,'ж'),(35,35,'Мартынов','Марта','кузьма','профессор','2013-10-14',12,2959.70,'ж'),(36,36,'Носков','Яна','Василий','профессор','1991-08-11',7,863.54,'ж'),(37,37,'Данилов','Рената','марк','ассистент','1974-01-18',2,4883.40,'ж'),(38,38,'Пестов','Антонина','Владислав','доцент','1974-01-01',9,4587.92,'ж'),(39,39,'Бобров','Инга','Матвей','старший преподаватель','2019-08-25',13,984.36,'ж'),(40,40,'Лазарев','Оксана','Добрыня','профессор','2003-01-01',12,1465.64,'ж'),(41,41,'Шилов','Мальвина','Мирослав','старший преподаватель','2008-12-06',12,4961.02,'ж'),(42,42,'Соколов','Алёна','Вадим','профессор','1985-02-16',9,1337.82,'ж'),(43,43,'Якушев','Марта','лаврентий','доцент','2020-02-11',15,4453.53,'ж'),(44,44,'Брагин','Владлена','Пётр','преподаватель','2015-11-08',3,2602.72,'ж'),(45,45,'Бобров','Изабелла','Лев','ассистент','1992-07-15',4,4768.06,'ж'),(46,46,'Попов','Ника','болеслав','доцент','1981-02-09',3,3111.99,'ж'),(47,47,'Лаврентьев','Алиса','Роберт','ассистент','2007-08-23',7,2466.66,'ж'),(48,48,'Уваров','Людмила','Иннокентий','доцент','1998-09-23',12,3287.82,'ж'),(49,49,'Кулаков','Нелли','Абрам','преподаватель','2010-02-15',1,1392.94,'ж'),(50,50,'Некрасов','Антонина','Михаил','старший преподаватель','1988-03-02',2,879.87,'ж');
/*!40000 ALTER TABLE `teachers` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-02-18 13:39:08
