-- MariaDB dump 10.19  Distrib 10.5.12-MariaDB, for Linux (x86_64)
--
-- Host: mysql.hostinger.ro    Database: u574849695_23
-- ------------------------------------------------------
-- Server version	10.5.12-MariaDB-cll-lve

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `students`
--

DROP TABLE IF EXISTS `students`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `students` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `id_groupes` int(11) NOT NULL,
  `surname` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `patronymic` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `gender` enum('м','ж') COLLATE utf8mb4_unicode_ci DEFAULT 'м',
  `birthdate` date NOT NULL DEFAULT '0000-00-00',
  `admission_year` int(11) NOT NULL,
  `children` tinyint(1) DEFAULT NULL,
  `scholarship` decimal(7,2) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `id_groupes` (`id_groupes`),
  CONSTRAINT `students_ibfk_1` FOREIGN KEY (`id_groupes`) REFERENCES `groupes` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=126 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `students`
--

LOCK TABLES `students` WRITE;
/*!40000 ALTER TABLE `students` DISABLE KEYS */;
INSERT INTO `students` VALUES (1,1,'Коновалов','Злата','добрыня','ж','1997-01-08',2003,15,555.09),(2,2,'Поляков','Елизавета','матвей','ж','1996-08-30',2020,2,140.38),(3,3,'Аксёнов','Алёна','Руслан','ж','2008-05-21',1977,11,637.69),(4,4,'Третьяков','Таисия','Святослав','ж','2019-10-07',2008,14,22.81),(5,5,'Кузнецов','Алёна','рафаил','ж','1984-06-24',1970,13,368.34),(6,6,'Ершов','Нина','Валентин','ж','2017-03-21',2021,7,86.44),(7,7,'Дмитриев','Маргарита','Ян','ж','1989-07-05',2001,4,424.54),(8,8,'Корнилов','Клавдия','Владислав','ж','1997-07-15',2001,9,486.22),(9,9,'Горшков','Инесса','ефим','ж','1998-04-14',1975,4,352.23),(10,10,'Дорофеев','Валерия','Донат','ж','1994-11-16',2014,10,756.27),(11,11,'Яковлев','Екатерина','Артемий','ж','1986-09-21',2005,15,668.55),(12,12,'Савин','Яна','Ираклий','ж','1982-06-27',2004,5,32.96),(13,13,'Иванов','Ульяна','Игорь','ж','1997-08-21',1985,7,620.47),(14,14,'Марков','Ева','Абрам','ж','1986-05-21',2004,7,785.65),(15,15,'Бирюков','Владлена','мирослав','ж','2022-02-28',2000,13,679.31),(16,16,'Веселов','Дина','Вениамин','ж','1979-09-11',1979,10,490.55),(17,17,'Мясников','Жанна','богдан','ж','2010-11-05',2018,7,26.39),(18,18,'Архипов','Жанна','Платон','ж','1995-08-30',2022,8,41.86),(19,19,'Кошелев','Светлана','Максим','ж','1999-01-19',2002,8,606.96),(20,20,'Селезнёв','Софья/София','Виктор','ж','1990-04-06',1986,3,52.93),(21,21,'Буров','Мария','Прохор','ж','2007-02-13',1986,1,341.27),(22,22,'Андреев','Клара','степан','ж','2020-03-08',1983,3,660.94),(23,23,'Буров','Анфиса','Степан','ж','2003-06-05',2009,14,306.47),(24,24,'Назаров','Яна','Альберт','ж','1987-10-01',1971,1,127.83),(25,25,'Захаров','Ника','Николай','ж','1980-07-22',1985,11,550.14),(26,26,'Лукин','Ксения','Герман','ж','1985-09-30',2020,3,477.56),(27,27,'Копылов','Таисия','Богдан','ж','2009-01-21',2006,15,80.71),(28,28,'Чернов','Марта','Радислав','ж','1970-10-30',2017,2,379.44),(29,29,'Фокин','Елена','макар','ж','2000-12-16',2006,0,325.93),(30,30,'Соболев','Мальвина','Иван','ж','1972-09-22',1981,4,550.13),(31,31,'Комиссаров','Рада','григорий','ж','1979-07-27',2017,12,649.88),(32,32,'Цветков','Софья/София','виль','ж','1997-12-13',1971,1,132.56),(33,33,'Некрасов','Ярослава','Прохор','ж','1982-12-22',1988,14,255.41),(34,34,'Никитин','Светлана','Иммануил','ж','1985-12-09',2017,11,73.84),(35,35,'Муравьёв','Ксения','Никита','ж','1981-12-10',1974,5,588.30),(36,36,'Горбачёв','Ярослава','Арсений','ж','1999-12-09',1978,8,117.39),(37,37,'Орлов','Розалина','святослав','ж','1973-11-23',2016,15,554.21),(38,38,'Фролов','Люся','Витольд','ж','2005-11-28',2008,5,595.19),(39,39,'Исаков','Алла','валериан','ж','2007-12-23',1988,11,753.43),(40,40,'Брагин','Капитолина','Ефим','ж','2012-10-24',1977,6,74.84),(41,41,'Блохин','Анжелика','Егор','ж','2009-11-30',2010,2,294.05),(42,42,'Исаков','Нонна','Вячеслав','ж','1997-12-25',1978,12,696.02),(43,43,'Смирнов','Анастасия','платон','ж','1988-06-23',1981,3,37.92),(44,44,'Евсеев','Людмила','егор','ж','1999-12-31',2014,1,71.08),(45,45,'Горбунов','Фаина','Феликс','ж','2006-11-06',2013,6,638.64),(46,46,'Комаров','Ольга','Арсений','ж','2006-07-30',1973,2,15.24),(47,47,'Беляев','Искра','иосиф','ж','1983-06-07',2021,4,50.09),(48,48,'Савин','Вера','Глеб','ж','1980-06-17',2003,13,310.23),(49,49,'Кириллов','Марта','Тит','ж','2010-12-05',1978,9,776.71),(50,50,'Кудрявцев','Раиса','вячеслав','ж','1996-10-25',1979,12,442.93),(51,51,'Самсонов','Тамара','Евгений','ж','2017-01-27',1982,6,653.84),(52,52,'Меркушев','Клавдия','Ярослав','ж','1997-07-14',2012,12,333.64),(53,53,'Лазарев','Анжелика','Дан','ж','1998-01-04',2000,4,80.48),(54,54,'Суханов','Мальвина','лев','ж','2017-07-21',1993,3,23.16),(55,55,'Ермаков','Нонна','донат','ж','1992-10-09',2023,2,614.23),(56,56,'Гуляев','Рада','Семён','ж','2004-06-26',2016,4,112.12),(57,57,'Васильев','Федосья','Пётр','ж','2020-05-05',2016,3,426.72),(58,58,'Волков','Альбина','герасим','ж','1999-05-27',2018,12,744.12),(59,59,'Жуков','Тамара','Захар','ж','1992-10-20',1976,8,685.22),(60,60,'Куликов','Варвара','Герасим','ж','1970-12-25',1978,5,372.68),(61,61,'Одинцов','Клавдия','Всеволод','ж','1997-08-28',1977,9,58.95),(62,62,'Лыткин','Анфиса','мирослав','ж','1970-08-14',2006,4,594.06),(63,63,'Козлов','Валерия','Семён','ж','2005-02-05',2008,9,186.46),(64,64,'Федотов','Лидия','Данила','ж','1985-04-19',2000,14,685.75),(65,65,'Рябов','Рената','назар','ж','2002-03-13',1984,0,216.83),(66,66,'Комиссаров','Дарья','Прохор','ж','2017-07-28',1986,3,538.87),(67,67,'Сафонов','Анжелика','иннокентий','ж','1984-02-08',2017,6,155.34),(68,68,'Копылов','Нонна','иосиф','ж','1995-10-18',2012,13,685.07),(69,69,'Селиверстов','Марта','Кузьма','ж','1993-03-30',1971,12,655.86),(70,1,'Носов','Алиса','Гавриил','ж','2010-07-22',2014,11,783.42),(71,2,'Щербаков','Евгения','григорий','ж','2014-01-03',2008,8,270.15),(72,3,'Фомин','Екатерина','Максим','ж','1999-03-28',2017,1,314.67),(73,4,'Кулаков','Мария','герман','ж','2007-12-14',2012,8,88.98),(74,5,'Ершов','Тамара','Аполлон','ж','2007-05-07',2003,15,223.51),(75,6,'Туров','Марина','Сава','ж','1987-11-08',1999,5,470.14),(76,7,'Суханов','Ирина','глеб','ж','2018-09-23',2005,15,752.73),(77,8,'Александров','Изабелла','Прохор','ж','1972-10-29',2007,6,683.39),(78,9,'Фадеев','Валерия','Юлий','ж','1984-02-08',1982,0,45.15),(79,10,'Дроздов','Раиса','Тит','ж','1972-02-09',1997,15,516.90),(80,11,'Новиков','Екатерина','Август','ж','1991-05-09',1979,4,310.50),(81,12,'Сафонов','Галина','Ираклий','ж','1974-10-18',2001,5,167.00),(82,13,'Фомин','Инесса','Радислав','ж','1972-02-18',1977,12,57.37),(83,14,'Костин','Маргарита','Ян','ж','2008-11-23',1998,0,223.96),(84,15,'Кулагин','Дарья','данила','ж','1986-08-05',1983,6,601.18),(85,16,'Кириллов','Ирина','Платон','ж','1980-11-12',2014,14,567.79),(86,17,'Ершов','Алина','Аким','ж','1984-05-27',1994,8,214.44),(87,18,'Красильников','Анна','иосиф','ж','2009-10-02',2001,14,606.05),(88,19,'Поляков','Инга','Адам','ж','2017-11-24',2016,9,671.60),(89,20,'Кондратьев','Олеся','марк','ж','1993-01-03',1998,6,447.05),(90,21,'Капустин','Олеся','марк','ж','1991-05-28',2004,4,374.34),(91,22,'Потапов','Алёна','Владлен','ж','1975-07-07',1976,7,34.56),(92,23,'Максимов','Владлена','Геннадий','ж','1988-03-24',2017,4,103.77),(93,24,'Лебедев','Зоя','Владлен','ж','1994-05-07',1989,7,220.01),(94,25,'Аксёнов','Розалина','клим','ж','2021-06-09',1996,9,330.89),(95,26,'Соловьёв','Жанна','Богдан','ж','1980-10-12',1972,9,229.84),(96,27,'Третьяков','Виктория','давид','ж','2005-06-09',2000,12,159.90),(97,28,'Воронцов','Рада','лев','ж','2013-08-31',1973,15,129.06),(98,29,'Белов','Клементина','ираклий','ж','1975-07-10',2001,9,765.77),(99,30,'Антонов','Эмма','захар','ж','1976-01-29',1998,1,463.53),(100,31,'Беляков','Вера','Тимофей','ж','1975-01-17',1970,14,586.62),(101,32,'Кириллов','Алёна','Игнатий','ж','1982-08-13',2003,15,453.18),(102,33,'Федотов','Марина','Никита','ж','2020-07-20',1992,2,423.88),(103,34,'Абрамов','Надежда','матвей','ж','1979-06-29',1972,3,276.13),(104,35,'Калинин','Ярослава','игнатий','ж','1995-02-27',1972,10,5.58),(105,36,'Макаров','Марта','Иннокентий','ж','2023-02-15',1974,10,283.54),(106,37,'Чернов','Алла','лаврентий','ж','1997-07-28',2007,13,530.54),(107,38,'Анисимов','Рада','Денис','ж','1990-12-30',1996,0,188.20),(108,39,'Уваров','Евгения','Радислав','ж','1989-06-20',1992,14,393.91),(109,40,'Блохин','Изабелла','геннадий','ж','1970-08-18',1988,5,383.69),(110,41,'Комаров','Светлана','Григорий','ж','2016-08-31',2021,1,175.83),(111,42,'Максимов','Альбина','Валентин','ж','1997-07-23',1980,15,331.89),(112,43,'Кузнецов','Ольга','Ростислав','ж','1970-02-12',1988,1,338.92),(113,44,'Зайцев','Марта','Гавриил','ж','1988-05-24',2005,7,699.39),(114,45,'Герасимов','Розалина','Дан','ж','1997-12-02',1995,4,150.95),(115,46,'Владимиров','Елена','Викентий','ж','1996-06-10',2021,1,537.84),(116,47,'Александров','Валентина','георгий','ж','2018-02-14',1997,14,100.69),(117,48,'Наумов','Татьяна','валериан','ж','2010-03-26',2017,0,634.94),(118,49,'Ермаков','Евгения','святослав','ж','1973-10-20',2012,3,188.02),(119,50,'Григорьев','Клементина','Пётр','ж','1995-04-10',1984,1,239.69),(120,51,'Овчинников','Олеся','герман','ж','2010-11-08',2014,12,736.17),(121,52,'Гаврилов','Яна','клим','ж','1987-10-17',2008,11,563.84),(122,53,'Селиверстов','Людмила','рафаил','ж','2014-08-31',2015,3,184.40),(123,54,'Потапов','Нонна','всеволод','ж','2008-03-03',2009,8,66.12),(124,55,'Максимов','Клара','Кузьма','ж','1989-05-11',2009,8,217.67),(125,56,'Гуляев','Екатерина','Нестор','ж','1973-01-18',2001,6,773.31);
/*!40000 ALTER TABLE `students` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-02-18 13:18:42
