-- MariaDB dump 10.19  Distrib 10.5.12-MariaDB, for Linux (x86_64)
--
-- Host: mysql.hostinger.ro    Database: u574849695_22
-- ------------------------------------------------------
-- Server version	10.5.12-MariaDB-cll-lve

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `teachers`
--

DROP TABLE IF EXISTS `teachers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `teachers` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `id_kafedras` int(11) NOT NULL,
  `surname` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `patronymic` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `category` enum('ассистент','преподаватель','старший преподаватель','доцент','профессор') COLLATE utf8mb4_unicode_ci DEFAULT 'преподаватель',
  `birthdate` date NOT NULL DEFAULT '0000-00-00',
  `children` int(11) NOT NULL,
  `salary` decimal(7,2) DEFAULT NULL,
  `gender` enum('м','ж') COLLATE utf8mb4_unicode_ci DEFAULT 'м',
  PRIMARY KEY (`id`),
  KEY `id_kafedras` (`id_kafedras`),
  CONSTRAINT `teachers_ibfk_1` FOREIGN KEY (`id_kafedras`) REFERENCES `kafedras` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=51 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `teachers`
--

LOCK TABLES `teachers` WRITE;
/*!40000 ALTER TABLE `teachers` DISABLE KEYS */;
INSERT INTO `teachers` VALUES (1,1,'Зуев','Пётр','Андрей','старший преподаватель','1977-03-27',9,2552.34,'м'),(2,2,'Филатов','глеб','бронислав','старший преподаватель','2022-09-28',7,1448.96,'м'),(3,3,'Третьяков','Геннадий','Эрик','старший преподаватель','2004-06-22',0,1681.03,'м'),(4,4,'Журавлёв','степан','Платон','ассистент','1986-03-04',2,893.30,'м'),(5,5,'Константинов','Алексей','Милан','доцент','1988-01-03',5,932.12,'м'),(6,6,'Зуев','Артём','Григорий','старший преподаватель','1995-08-10',4,868.33,'м'),(7,7,'Сидоров','Альберт','Сава','доцент','2011-11-21',2,2097.91,'м'),(8,8,'Панфилов','Никодим','Аркадий','преподаватель','1976-01-21',4,1238.42,'м'),(9,9,'Мясников','давид','Аким','преподаватель','1994-12-10',9,1599.74,'м'),(10,10,'Вишняков','Никодим','богдан','доцент','1992-12-01',5,1423.13,'м'),(11,11,'Кошелев','Тимофей','Даниил','доцент','2011-09-11',6,1764.33,'м'),(12,12,'Горбунов','Матвей','Матвей','профессор','2002-02-27',4,2061.41,'м'),(13,13,'Кудряшов','рафаил','Богдан','профессор','1986-05-20',1,2656.73,'м'),(14,14,'Жуков','Виктор','бронислав','преподаватель','2015-12-15',0,1140.12,'м'),(15,15,'Шарапов','виль','артемий','преподаватель','2006-12-19',9,2348.16,'м'),(16,16,'Королёв','Савва','борис','преподаватель','2010-10-24',4,1080.14,'м'),(17,17,'Белозёров','Антон','Данила','ассистент','1999-07-26',3,2286.18,'м'),(18,18,'Наумов','Антонин','вячеслав','старший преподаватель','1992-12-29',6,2363.40,'м'),(19,19,'Смирнов','дан','Руслан','профессор','1989-10-13',8,2167.52,'м'),(20,20,'Гаврилов','Степан','владлен','ассистент','1984-11-08',5,1481.44,'м'),(21,21,'Данилов','Ростислав','валериан','доцент','1985-11-16',4,2474.89,'м'),(22,22,'Владимиров','герасим','Родион','преподаватель','1971-07-10',8,1398.56,'м'),(23,23,'Симонов','Константин','Ананий','старший преподаватель','1999-10-06',8,1529.93,'м'),(24,24,'Носков','Ананий','Ананий','старший преподаватель','1992-08-31',1,1716.70,'м'),(25,25,'Гуляев','гордей','богдан','старший преподаватель','2018-12-08',2,2201.39,'м'),(26,26,'Тетерин','Семён','макар','ассистент','1983-01-06',2,1025.20,'м'),(27,27,'Лобанов','платон','Герасим','профессор','2005-09-26',5,1193.17,'м'),(28,28,'Логинов','Глеб','никодим','ассистент','1988-09-18',1,2020.56,'м'),(29,29,'Щукин','мирослав','макар','ассистент','1995-05-16',9,1279.05,'м'),(30,30,'Лыткин','Игнатий','Святослав','преподаватель','1992-08-20',6,2627.43,'м'),(31,31,'Лебедев','Бронислав','Марк','доцент','2002-04-30',9,1781.76,'м'),(32,32,'Шилов','виктор','дан','ассистент','1996-01-11',5,817.40,'м'),(33,33,'Беляков','Максим','Роман','профессор','1997-02-04',0,2699.69,'м'),(34,34,'Беляев','Семён','Захар','доцент','1973-09-19',0,1359.41,'м'),(35,35,'Осипов','Ян','Прохор','преподаватель','1989-04-20',0,2394.43,'м'),(36,36,'Мясников','Нестор','Николай','преподаватель','2010-12-25',7,2489.28,'м'),(37,37,'Евсеев','Андрей','ефим','доцент','2011-01-31',1,1814.67,'м'),(38,38,'Игнатьев','Лев','Павел','старший преподаватель','1977-05-26',1,2410.37,'м'),(39,39,'Кириллов','Афанасий','Глеб','ассистент','1997-07-30',0,1236.53,'м'),(40,40,'Жуков','Влад','Роман','преподаватель','1982-05-02',1,1071.43,'м'),(41,41,'Гущин','Максим','Лев','преподаватель','2012-05-25',0,1885.63,'м'),(42,42,'Воробьёв','Леонид','никодим','преподаватель','2001-02-01',1,1029.79,'м'),(43,43,'Киселёв','григорий','Валерий','профессор','2008-02-26',5,857.38,'м'),(44,44,'Белозёров','Добрыня','Артур','преподаватель','1987-05-05',1,1144.16,'м'),(45,45,'Борисов','Савва','Вениамин','доцент','2003-05-14',5,2358.42,'м'),(46,46,'Шилов','Спартак','Всеволод','профессор','2010-04-20',3,2448.99,'м'),(47,47,'Денисов','Адам','григорий','преподаватель','2003-11-16',3,1998.76,'м'),(48,48,'Миронов','Кирилл','Август','старший преподаватель','1983-06-19',4,1599.13,'м'),(49,49,'Гордеев','богдан','Родион','преподаватель','2012-02-09',0,2893.96,'м'),(50,50,'Фролов','Олег','Андрей','профессор','2006-01-28',8,1065.68,'м');
/*!40000 ALTER TABLE `teachers` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-02-18 11:15:02
