-- MariaDB dump 10.19  Distrib 10.5.12-MariaDB, for Linux (x86_64)
--
-- Host: mysql.hostinger.ro    Database: u574849695_22
-- ------------------------------------------------------
-- Server version	10.5.12-MariaDB-cll-lve

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `students`
--

DROP TABLE IF EXISTS `students`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `students` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `id_groupes` int(11) NOT NULL,
  `surname` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `patronymic` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `gender` enum('м','ж') COLLATE utf8mb4_unicode_ci DEFAULT 'м',
  `birthdate` date NOT NULL DEFAULT '0000-00-00',
  `admission_year` int(11) NOT NULL,
  `children` tinyint(1) DEFAULT NULL,
  `scholarship` decimal(7,2) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `id_groupes` (`id_groupes`),
  CONSTRAINT `students_ibfk_1` FOREIGN KEY (`id_groupes`) REFERENCES `groupes` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=126 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `students`
--

LOCK TABLES `students` WRITE;
/*!40000 ALTER TABLE `students` DISABLE KEYS */;
INSERT INTO `students` VALUES (1,1,'Потапов','Платон','Евгений','м','2006-12-07',2016,0,365.15),(2,2,'Гришин','витольд','Ефим','м','2002-03-21',2008,1,308.92),(3,3,'Петухов','Святослав','Евгений','м','1985-11-03',2008,1,65.79),(4,4,'Никифоров','викентий','Клим','м','1997-09-02',1973,1,256.34),(5,5,'Титов','добрыня','Ананий','м','2012-03-26',2015,1,14.78),(6,6,'Миронов','Роман','Владлен','м','2011-03-10',2017,1,334.93),(7,7,'Родионов','Август','виль','м','1981-01-16',1976,1,487.05),(8,8,'Устинов','Аполлон','Леонид','м','2007-02-21',2014,0,749.24),(9,9,'Никонов','Игнат','Данила','м','2011-08-29',2017,0,367.42),(10,10,'Беспалов','Кузьма','Нестор','м','2010-06-17',2004,0,368.35),(11,11,'Лукин','Болеслав','марк','м','1989-04-26',2003,1,156.13),(12,12,'Зимин','Эдуард','Руслан','м','1980-08-10',1971,1,172.40),(13,13,'Зиновьев','Игорь','Валентин','м','1989-07-11',1996,1,164.08),(14,14,'Афанасьев','Марат','Филипп','м','1988-03-27',2005,1,54.84),(15,15,'Субботин','Родион','Павел','м','2016-01-10',1979,0,68.81),(16,16,'Гордеев','лев','Ростислав','м','2016-07-01',2004,0,694.28),(17,17,'Самойлов','Марат','Вениамин','м','2008-02-19',1972,0,47.52),(18,18,'Ефимов','валерий','Прохор','м','1993-09-07',1975,0,228.65),(19,19,'Константинов','георгий','Иннокентий','м','2002-08-09',1985,0,138.64),(20,20,'Федотов','Руслан','Гордей','м','1974-07-16',1985,1,474.47),(21,21,'Селиверстов','Август','Яков','м','2006-04-12',2008,0,797.19),(22,22,'Гусев','Глеб','Святослав','м','2021-04-25',2012,1,299.56),(23,23,'Мельников','Влад','Гарри','м','1989-04-24',1974,0,262.58),(24,24,'Ильин','Леонид','Ярослав','м','2002-06-20',1994,0,677.04),(25,25,'Некрасов','родион','Родион','м','2019-06-24',1980,1,394.47),(26,26,'Кудрявцев','Тарас','Александр','м','1978-10-04',2011,0,590.80),(27,27,'Суханов','игнатий','Константин','м','1985-05-04',1973,0,42.06),(28,28,'Терентьев','ефим','ираклий','м','2017-12-03',2015,0,731.47),(29,29,'Титов','виль','Михаил','м','1987-06-11',2001,0,427.86),(30,30,'Голубев','Иммануил','Артур','м','1978-12-10',2018,1,545.01),(31,31,'Носов','Андрей','Адам','м','1995-06-04',1971,1,321.07),(32,32,'Калашников','Болеслав','Викентий','м','2007-06-08',2017,1,375.65),(33,33,'Муравьёв','Ананий','Альберт','м','2008-11-06',1974,0,579.98),(34,34,'Дорофеев','герман','Валерий','м','1991-03-04',2004,1,302.77),(35,35,'Голубев','Рафаил','Семён','м','1973-08-05',1980,0,590.20),(36,36,'Бобров','Макар','Тит','м','1982-05-04',2001,1,636.10),(37,37,'Цветков','Павел','лев','м','1975-08-05',1978,1,175.45),(38,38,'Афанасьев','Ярослав','артемий','м','2006-04-15',2005,1,734.81),(39,39,'Игнатьев','Алексей','Степан','м','2021-07-28',1976,0,342.34),(40,40,'Шилов','Феликс','Павел','м','2009-03-17',2002,1,747.72),(41,41,'Вишняков','никодим','Роберт','м','2019-07-28',1978,1,2.76),(42,42,'Шубин','Донат','Семён','м','1972-09-05',2021,0,376.46),(43,43,'Соболев','Афанасий','милан','м','1986-06-27',2012,0,307.90),(44,44,'Зуев','Владлен','Сава','м','1996-01-10',1986,1,367.12),(45,45,'Бобров','Евгений','Борис','м','2006-09-24',1986,0,81.62),(46,46,'Евсеев','богдан','Илларион','м','2021-01-31',1998,1,613.53),(47,47,'Лапин','Виталий','герасим','м','1995-10-15',1981,1,152.00),(48,48,'Савин','милан','Артур','м','2015-04-17',2009,1,782.34),(49,49,'Шашков','Назар','гордей','м','1992-07-11',2001,1,440.68),(50,50,'Федотов','Тимур','викентий','м','2019-07-04',1972,1,357.36),(51,51,'Попов','Тимофей','Влад','м','2010-04-10',1977,0,375.27),(52,52,'Герасимов','Семён','игнат','м','1986-10-23',1985,1,645.14),(53,53,'Зиновьев','Виль','Георгий','м','2009-07-03',1984,1,512.65),(54,54,'Ситников','Иммануил','Гарри','м','1994-09-05',1970,1,662.83),(55,55,'Мартынов','Павел','Аполлон','м','2002-05-01',2005,0,26.77),(56,56,'Князев','матвей','Максим','м','1971-04-12',1978,0,46.61),(57,57,'Голубев','григорий','Ростислав','м','1982-12-13',1998,0,37.33),(58,58,'Пономарёв','марк','Дан','м','2002-05-06',1972,1,178.43),(59,59,'Потапов','Артём','Данила','м','1995-01-21',2016,0,346.26),(60,60,'Сысоев','владлен','Дмитрий','м','1984-10-07',1980,0,525.72),(61,61,'Кабанов','виль','давид','м','1987-12-12',1999,1,565.96),(62,62,'Симонов','игнат','Владимир','м','2015-09-20',1981,0,397.38),(63,63,'Фролов','Платон','Антонин','м','2022-09-15',1993,1,353.78),(64,64,'Горбачёв','болеслав','Денис','м','1981-03-11',1972,0,66.11),(65,65,'Рябов','Захар','Тимофей','м','1970-03-10',2017,0,502.00),(66,66,'Носков','марк','Савва','м','1985-06-07',2017,0,714.21),(67,67,'Голубев','Яков','Захар','м','2005-03-16',1985,1,512.03),(68,68,'Мартынов','донат','Гордей','м','1973-05-26',1975,1,451.36),(69,69,'Кондратьев','глеб','Эрик','м','2013-05-26',2017,0,570.06),(70,1,'Матвеев','Иван','Егор','м','1982-01-16',1980,0,752.16),(71,2,'Константинов','Юлий','степан','м','1996-06-28',1974,0,534.88),(72,3,'Субботин','Ефим','Платон','м','1994-11-08',1995,0,360.29),(73,4,'Колесников','Марат','Филипп','м','1982-06-07',1971,0,26.29),(74,5,'Голубев','сава','гордей','м','1991-08-02',1974,1,417.36),(75,6,'Фёдоров','виль','валерий','м','2022-09-19',2021,1,120.18),(76,7,'Селиверстов','Артур','донат','м','1982-10-17',1988,0,249.55),(77,8,'Белозёров','Владимир','Альберт','м','1992-07-30',2022,0,288.66),(78,9,'Соболев','борис','Болеслав','м','1991-03-26',1995,0,669.45),(79,10,'Виноградов','бронислав','Викентий','м','1984-05-15',2003,1,696.41),(80,11,'Смирнов','Филипп','богдан','м','2003-01-22',1995,1,604.78),(81,12,'Уваров','Павел','Арсений','м','1998-12-01',2006,0,357.31),(82,13,'Лаврентьев','Всеволод','Викентий','м','1971-12-28',1993,0,24.37),(83,14,'Рогов','клим','георгий','м','1981-05-26',2018,0,95.56),(84,15,'Буров','Семён','ефим','м','1992-08-09',1996,1,79.32),(85,16,'Цветков','Антон','Август','м','1999-05-16',1986,0,219.43),(86,17,'Сорокин','Юлий','иосиф','м','1998-06-12',1996,1,626.16),(87,18,'Власов','Арсений','Владлен','м','2007-07-27',2015,1,514.21),(88,19,'Макаров','Роман','Иосиф','м','1981-12-12',2000,0,677.26),(89,20,'Капустин','Болеслав','Андрей','м','1992-11-05',1996,0,637.87),(90,21,'Силин','Адриан','даниил','м','2017-06-07',1984,1,691.62),(91,22,'Медведев','Никита','захар','м','1995-08-30',1979,1,152.96),(92,23,'Горбунов','Виль','владлен','м','2010-01-21',2008,1,571.89),(93,24,'Гришин','Альберт','Артемий','м','2011-01-23',1990,0,678.07),(94,25,'Суворов','Нестор','Антонин','м','2020-02-14',2019,0,190.73),(95,26,'Галкин','сава','Денис','м','1989-05-23',1979,0,749.65),(96,27,'Субботин','назар','Тимур','м','1994-11-16',2010,1,258.08),(97,28,'Блинов','марк','Макар','м','1970-09-03',2017,1,667.77),(98,29,'Игнатов','Иммануил','Спартак','м','2003-10-18',1989,1,701.07),(99,30,'Волков','добрыня','Илларион','м','2015-04-28',2007,1,633.83),(100,31,'Воробьёв','Радислав','Эрик','м','2014-07-21',1975,0,688.60),(101,32,'Марков','Эдуард','Афанасий','м','2010-03-11',2015,0,292.89),(102,33,'Владимиров','Степан','Гавриил','м','2007-05-30',1986,1,692.58),(103,34,'Третьяков','Абрам','Влад','м','2015-03-01',1988,1,435.18),(104,35,'Сорокин','владлен','богдан','м','2017-02-16',1984,0,397.98),(105,36,'Гаврилов','викентий','Семён','м','1993-12-18',1972,0,704.97),(106,37,'Зайцев','Клим','Адам','м','1970-11-29',1989,1,30.66),(107,38,'Сафонов','Спартак','Дмитрий','м','2012-04-17',1983,1,421.05),(108,39,'Гуляев','богдан','Кирилл','м','2009-06-24',1990,0,270.58),(109,40,'Константинов','Фёдор','герман','м','1997-08-19',1999,0,547.84),(110,41,'Степанов','Яков','владислав','м','2013-03-24',2012,0,793.02),(111,42,'Егоров','Ираклий','рафаил','м','1983-07-14',1989,1,701.18),(112,43,'Сысоев','Аким','Эдуард','м','1982-03-07',2002,0,713.27),(113,44,'Дорофеев','степан','Григорий','м','2013-09-13',1983,0,430.28),(114,45,'Рогов','Юлиан','Аким','м','1997-03-03',1980,1,187.71),(115,46,'Носов','степан','иннокентий','м','1997-03-22',1989,1,57.08),(116,47,'Хохлов','болеслав','савва','м','2018-07-09',2012,1,334.68),(117,48,'Субботин','Родион','Дан','м','1973-09-24',2004,1,449.55),(118,49,'Меркушев','Дан','Лаврентий','м','2002-11-07',2001,0,299.44),(119,50,'Шестаков','Михаил','Герасим','м','2019-05-23',1991,1,611.94),(120,51,'Шаров','Герасим','Виль','м','1997-04-13',2010,0,777.75),(121,52,'Фокин','Викентий','Егор','м','2011-02-21',1970,1,214.12),(122,53,'Рожков','вячеслав','Ярослав','м','2021-05-10',2020,0,483.60),(123,54,'Блинов','иннокентий','геннадий','м','1974-01-08',2004,1,83.04),(124,55,'Терентьев','Илья','милан','м','2014-03-26',2013,1,95.16),(125,56,'Буров','донат','Григорий','м','1971-09-04',2007,1,324.49);
/*!40000 ALTER TABLE `students` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-02-18 11:29:52
