// Задание 1: Если переменная a равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
var a = prompt("Введите число: ");
if (a == 0) {
    alert("Верно");
} else {
    alert("Неверно");
}

// Задание 2: Если переменная a больше нуля, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
var a = prompt("Введите число: ");
if (a > 0) {
    alert("Верно");
} else {
    alert("Неверно");
}

// Задание 3: Если переменная a меньше нуля, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
var a = prompt("Введите число: ");
if (a < 0) {
    alert("Верно");
} else {
    alert("Неверно");
}

// Задание 4: Если переменная a больше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
var a = prompt("Введите число: ");
if (a >= 0) {
    alert("Верно");
} else {
    alert("Неверно");
}

// Задание 5: Если переменная a меньше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
var a = prompt("Введите число: ");
if (a <= 0) {
    alert("Верно");
} else {
    alert("Неверно");
}

// Задание 6: Если переменная a не равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
var a = prompt("Введите число: ");
if (a != 0) {
    alert("Верно");
} else {
    alert("Неверно");
}

// Задание 7: Если переменная a равна 'test', то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 'test', 'тест', 3.
var a = prompt("Введите слово: ");
if (a == "test") {
    alert("Верно");
} else {
    alert("Неверно");
}

// Задание 8: Если переменная a равна '1' и по значению и по типу, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном '1', 1, 3.
var a = prompt("Введите число: ");
if (a == "1" && a == 1) {
    alert("Верно");
} else {
    alert("Неверно");
}

// Задание 9: Если переменная test равна true, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при test, равном true, false. Напишите два варианта скрипта - с короткой записью и с длинной.
var test = true;
test == true ? alert("Верно") : alert("Неверно");

var test = true;
if (test == true) {
    alert("Верно");
}
if (test == false) {
    alert("Неверно");
}

// Задание 10: Если переменная test не равна true, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при test, равном true, false. Напишите два варианта скрипта - с короткой записью и с длинной.
var test = true;
test != true ? alert("Верно") : alert("Неверно");

var test = true;
if (test != true) {
    alert("Верно");
}
if (test != false) {
    alert("Неверно");
}

// Задание 11: Если переменная a больше нуля и меньше 5-ти, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 5, 0, -3, 2.
var a = 666;
if (a > 5 && a < 5) {
    alert("Верно");
} else {
    alert("Неверно");
}

// Задание 12: Если переменная a равна нулю или равна двум, то прибавьте к ней 7, иначе поделите ее на 10. Выведите новое значение переменной на экран. Проверьте работу скрипта при a, равном 5, 0, -3, 2.
var a = parseInt(prompt("Введите число"));
if (a == 0 || a == 2) {
    a += a + 7;
} else {
    a /= 10;
}
alert(a);

// Задание 13: Если переменная a равна или меньше 1, а переменная b больше или равна 3, то выведите сумму этих переменных, иначе выведите их разность (результат вычитания). Проверьте работу скрипта при a и b, равном 1 и 3, 0 и 6, 3 и 5.
var a = parseInt(prompt("Введите число"));
var b = parseInt(prompt("Введите число"));
if (a <= 1 && b >= 3) {
    alert(a + b);
} else {
    alert(a - b);
}

// Задание 14: Если переменная a больше 2-х и меньше 11-ти, или переменная b больше или равна 6-ти и меньше 14-ти, то выведите 'Верно', в противном случае выведите 'Неверно'.
var a = parseInt(prompt("Введите число"));
var b = parseInt(prompt("Введите число"));
if ((a > 2 && a < 11) || (b >= 6 && b < 14)) {
    alert("Верно");
} else {
    alert("Неверно");
}

// Задание 15: Переменная num может принимать 4 значения: 1, 2, 3 или 4. Если она имеет значение '1', то в переменную result запишем 'зима', если имеет значение '2' – 'весна' и так далее. Решите задачу через switch-case.
var num = prompt("Введите цифру от 1 до 4");
switch (num) {
    case "1":
        alert((result = "Зима"));
        break;
    case "2":
        alert((result = "Весна"));
        break;
    case "3":
        alert((result = "Лето"));
        break;
    case "4":
        alert((result = "Осень"));
        break;
}

// Задание 16: В переменной day лежит какое-то число из интервала от 1 до 31. Определите в какую декаду месяца попадает это число (в первую, вторую или третью).
var day = prompt("Введите число из интервала от 1 до 31");
if (day >= 1 && day <= 10) {
    alert("Это число в 1-й декаде месяца");
}
if (day >= 11 && day <= 20) {
    alert("Это число в 2-й декаде месяца");
}
if (day >= 21 && day <= 31) {
    alert("Это число в 3-й декаде месяца");
}

// Задание 17: В переменной month лежит какое-то число из интервала от 1 до 12. Определите в какую пору года попадает этот месяц (зима, лето, весна, осень).
var month = prompt("Введите число из интервала от 1 до 12");
if (month >= 1 && month <= 2) {
    alert("Это число попадает в месяц зимы");
}
if (month >= 3 && month <= 5) {
    alert("Это число попадает в месяц весны");
}
if (month >= 6 && month <= 8) {
    alert("Это число попадает в месяц лета");
}
if (month >= 9 && month <= 11) {
    alert("Это число попадает в месяц осени");
}

// Задание 18: Дана строка, состоящая из символов, например, 'abcde'. Проверьте, что первым символом этой строки является буква 'a'. Если это так - выведите 'да', в противном случае выведите 'нет'.
var a = prompt("Введите строку");
if (a[0] == "a") {
    alert("Да");
} else {
    alert("Нет");
}

// Задание 19: Дана строка с цифрами, например, '12345'. Проверьте, что первым символом этой строки является цифра 1, 2 или 3. Если это так - выведите 'да', в противном случае выведите 'нет'.
var a = "123442";
if (a[0] == "1" || a[0] == "2" || a[0] == "3") {
    alert("Да");
} else {
    alert("Нет");
}

// Задание 20: Дана строка из 3-х цифр. Найдите сумму этих цифр. То есть сложите как числа первый символ строки, второй и третий.
a = "123";
alert(Number(a[0]) + Number(a[1]) + Number(a[2]));

// Задание 21: Дана строка из 6-ти цифр. Проверьте, что сумма первых трех цифр равняется сумме вторых трех цифр. Если это так - выведите 'да', в противном случае выведите 'нет'.
a = "123321";
b = Number(a[0]) + Number(a[1]) + Number(a[2]);
c = Number(a[3]) + Number(a[4]) + Number(a[5]);
if (b == c) {
    alert("Да");
} else {
    alert("Нет");
}
